In [5]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv("D:/3_STASTICS/income.csv")

In [7]:
df

        Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000

In [13]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [17]:
df.income.quantile(0.25)

5500.0

In [19]:
df.income.quantile(1)

10000000.0

In [25]:
percentile_99=df.income.quantile(0.99)
percentile_99

9400479.999999994

In [29]:
df_no_outlier=df[df.income<=percentile_99]
df_no_outlier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [20]:
df=pd.read_csv("D:/3_STASTICS/income.csv",names=["name","income"],skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000